# BuiltInFailures.ConnectorFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ConnectorFailures Class
BuiltInFailures Class Members See Also
---
Failures about Connector.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class ConnectorFailures
```

Visual Basic
---
```text
Public NotInheritable Class ConnectorFailures
```

Visual C++
---
```text
public ref class ConnectorFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..ConnectorFailures
# See Also
BuiltInFailures..::..ConnectorFailures Members
Autodesk.Revit.DB Namespace